export interface Book {
  id: string;
  title: string;
  description: string;
  cover: string;
  pdfUrl: string;
}

const books: Book[] = [
  {
    id: "الإبداع",
    title: "كتاب الإبداع",
    description:
      'يتناول كتاب "الإبداع" هذا المفهوم بوصفه أحد أهم مقومات المنظمات الناجحة والمتميزة في أدائها، والركيزة الأساسية لتحقيق إدارة فعّالة. ويقدّم الكتاب الإبداع من زوايا متعددة؛ إذ يستعرض أبرز النظريات المفسِّرة له—كالنظريات السلوكية والمعرفية والتنظيمية—ويشرح مستوياته على الصعيد الفردي والجماعي والتنظيمي. كما يركّز على مهارات التفكير الإبداعي الأساسية مثل الطلاقة والمرونة والأصالة والثقة بالنفس، ويتناول العوامل المؤثرة فيه والمعوقات التي تحدّ من ظهوره داخل بيئة العمل. إضافة إلى ذلك، يناقش الكتاب أنواع الإبداع المختلفة، ويُبرز الفروق بين الإبداع والابتكار والتغيير التنظيمي.',
    cover: `/covers/${"الإبداع"}.png`,
    pdfUrl: `/books/${"الإبداع"}.pdf`,
  },
  {
    id: "القيادة-الأبوية",
    title: "كتاب القيادة الأبوية",
    description:
      'يأتي كتاب "القيادة الأبوية" ليسلط الضوء على أحد أنماط القيادة الحديثة التي لاقت اهتمامًا كبيرًا من الباحثين، خاصةً في المنظمات الحديثة التي تحتاج إلى أن تُقاد بطريقة سليمة.\n\nإن القيادة الأبوية هي ذلك النمط القيادي الذي يُشبه دور الأب في الأسرة، حيث يجمع بين السلطة القوية والشعور بالقلق والاهتمام تجاه المرؤوسين ومراعاة مصالحهم. وتعمل هذه النظرية على قلب مفهوم القيادة رأسًا على عقب، حيث يصبح اهتمام القائد بالمرؤوسين أولوية.\n\nيُعد هذا الكتاب مرجعًا مهمًا في مجال السلوك التنظيمي، حيث يركز على ماهية القيادة الأبوية وأهميتها، كما يتعرض بالتفصيل لسلوكيات وأبعاد هذا النمط القيادي.',
    cover: `/covers/${"القيادة-الأبوية"}.png`,
    pdfUrl: `/books/${"القيادة-الأبوية"}.pdf`,
  },
  {
    id: "القيادة-الخادمة",
    title: "كتاب القيادة الخادمة",
    description:
      'يقدّم كتاب "القيادة الخادمة" دراسة شاملة لمفهوم هذا النمط القيادي، موضحًا ماهيته وأهميته وخصائصه وأبعاده، إضافة إلى استعراض أبرز الانتقادات الموجّهة إليه. وتُعرَّف القيادة الخادمة بوصفها أسلوبًا قياديًا أخلاقيًا ظهر نحو عام 1977م، يقوم فيه القائد بخدمة مرؤوسيه والاهتمام بمصالحهم، مع التركيز على تطويرهم وتزويدهم بما يحتاجون إليه من دعم وتمكين لتحقيق الأهداف المرجوّة. ويمثّل هذا النموذج دعوة إلى رؤية جديدة للقيادة، تنتقل من النظرة الهرمية التقليدية إلى منظور يقوم على القيادة من الأسفل إلى الأعلى. وتنبع أهميته من آثاره الإيجابية التي ينعكس معظمها على أداء المنظمة، مثل تعزيز الثقة، وتحفيز الإبداع، ورفع مستويات الالتزام الوظيفي.',
    cover: `/covers/${"القيادة-الخادمة"}.png`,
    pdfUrl: `/books/${"القيادة-الخادمة"}.pdf`,
  },
];

export default books;
